In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

In [2]:
# 1. 2차원 표
df = pd.DataFrame(data=np.arange(20).reshape(4,5), index=list('abcd'), columns=list('vwxyz'))
df

    v   w   x   y   z
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [6]:
# 2. Dictionary List
dl = [{'name':'James', 'age':24, 'job':'student'},
        {'name':'Maria', 'age':36, 'job':'teacher'},
        {'name':'Brian', 'age':30, 'job':'programmer'}]
df_l = pd.DataFrame(data=dl)
df_l

    name  age         job
0  James   24     student
1  Maria   36     teacher
2  Brian   30  programmer

In [7]:
ld = {'name':['James', 'Maria', 'Brian'],
      'age':[24, 36, 30],
      'job':['student', 'teacher', 'programmer']}
df_d = pd.DataFrame(data=ld)
df_d

    name  age         job
0  James   24     student
1  Maria   36     teacher
2  Brian   30  programmer

In [8]:
df_l.equals(df_d)

True